utils/scripts/estudioAutomatizacionPerfiles (Copy)/aleronTraseroV1/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
|       o          |                                                          |
|    o     o       | HELYX(R): Open-source CFD for Enterprise                 |
|   o   O   o      | Version: v4.3.1                                          |
|    o     o       | Engys Ltd. http://www.engys.com                          |
|       o          |                                                          |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version 2.0;
    format ascii;
    class dictionary;
    location system;
    object blockMeshDict;
}
    convertToMeters 1;
    vertices
    (
        ( -4 0.0 -8.0 )
        ( 15 0.0 -8.0 )
        ( 15 0.4 -8.0 )
        ( -4 0.4 -8.0 )
        ( -4 0.0 8.0 )
        ( 15 0.0 8.0 )
        ( 15 0.4 8.0 )
        ( -4 0.4 8.0 )
    );
    blocks
    (
    hex (0 1 2 3 4 5 6 7) (40 1 20) simpleGrading (1 1 1)
    );
    edges ( );
    patches
    (
        wall Inlet ( ( 0 4 7 3 ) )
        wall Outlet ( ( 1 2 6 5 ) )
        wall Back ( ( 0 1 5 4 ) )
        wall Front ( ( 3 7 6 2 ) )
        wall Bottom ( ( 0 3 2 1 ) )
        wall Top ( ( 4 5 6 7 ) )
    );
    mergePatchPairs ( );

