utils/scripts/estudioAutomatizacionPerfiles (Copy)/aleronTraseroV1/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
|       o        |                                                            |
|    o     o     |  HELYX (R) : Open-source CFD for Enterprise                |
|   o   O   o    |  Version : 4.4.1                                           |
|    o     o     |  ENGYS Ltd. <http://engys.com/>                            |
|       o        |                                                            |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      binary;
    class       polyBoundaryMesh;
    arch        "LSB;label=32;scalar=64";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

7
(
    Inlet
    {
        type            patch;
        physicalType    inlet;
        nFaces          20;
        startFace       96268;
    }
    Outlet
    {
        type            patch;
        physicalType    outlet;
        nFaces          20;
        startFace       96288;
    }
    Back
    {
        type            empty;
        inGroups        1(empty);
        nFaces          47879;
        startFace       96308;
    }
    Front
    {
        type            empty;
        inGroups        1(empty);
        nFaces          47879;
        startFace       144187;
    }
    Bottom
    {
        type            wall;
        inGroups        1(wall);
        nFaces          40;
        startFace       192066;
    }
    Top
    {
        type            wall;
        inGroups        1(wall);
        nFaces          40;
        startFace       192106;
    }
    e423_0
    {
        type            wall;
        inGroups        1(wall);
        nFaces          178;
        startFace       192146;
    }
)

// ************************************************************************* //
