utils/scripts/estudioAutomatizacionPerfiles (Copy)/aleronTraseroV1/0.orig/U
/*--------------------------------*- C++ -*----------------------------------*\
|       o        |                                                            |
|    o     o     |  HELYX (R) : Open-source CFD for Enterprise                |
|   o   O   o    |  Version : 4.4.1                                           |
|    o     o     |  ENGYS Ltd. <http://engys.com/>                            |
|       o        |                                                            |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];


internalField   uniform ( 11.085 0 0 );

boundaryField
{
    Inlet
    {
        type            uniformFixedValue;
        inputValue      uniform ( 11.085 0 0 );
        value           uniform ( 11.085 0 0 );
        uniformValue    constant ( 11.085 0 0 );
    }
    Outlet
    {
        type            pressureVelocity;
        refValue        uniform ( 0 0 0 );
        refGradient     uniform ( 0 0 0 );
        valueFraction   uniform ( 0 0 0 0 0 0 );
        value           uniform ( 0 0 0 );
        directionSpecification patchNormal;
    }
    Back
    {
        type            empty;
    }
    Front
    {
        type            empty;
    }
    Bottom
    {
        type            slip;
        inputValue      uniform ( 0 0 0 );
        value           uniform ( 11.085 0 0 );
    }
    Top
    {
        type            slip;
        inputValue      uniform ( 0 0 0 );
        value           uniform ( 11.085 0 0 );
    }
    e423_0 
    { 
        type wallVelocity; 
        value uniform (0 0 0); 
    } // Perfil
}


// ************************************************************************* //
