utils/scripts/estudioAutomatizacionPerfiles (Copy)/aleronTraseroV1/0.orig/p
/*--------------------------------*- C++ -*----------------------------------*\
|       o        |                                                            |
|    o     o     |  HELYX (R) : Open-source CFD for Enterprise                |
|   o   O   o    |  Version : 4.4.1                                           |
|    o     o     |  ENGYS Ltd. <http://engys.com/>                            |
|       o        |                                                            |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -1 -2 0 0 0 0];


internalField   uniform 0;

boundaryField
{
    Inlet
    {
        type            fixedFluxPressure;
        gradient        uniform 0;
        value           uniform 0;
    }
    Outlet
    {
        type            fixedValue;
        inputValue      uniform 0;
        value           uniform 0;
    }
    Back
    {
        type            empty;
    }
    Front
    {
        type            empty;
    }
    Bottom
    {
        type            zeroGradient;
    }
    Top
    {
        type            zeroGradient;
    }
    e423_0 
    { 
        type fixedFluxPressure; 
        value uniform 0; 
    }
}


// ************************************************************************* //
