utils/scripts/estudioAutomatizacionPerfiles (Copy)/aleronTraseroV1/0.orig/k
/*--------------------------------*- C++ -*----------------------------------*\
|       o        |                                                            |
|    o     o     |  HELYX (R) : Open-source CFD for Enterprise                |
|   o   O   o    |  Version : 4.4.1                                           |
|    o     o     |  ENGYS Ltd. <http://engys.com/>                            |
|       o        |                                                            |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      k;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];


internalField   uniform 0.46079;

boundaryField
{
    Inlet
    {
        type            turbulentIntensityKineticEnergyInlet;
        intensity       0.05;
        value           uniform 0.46079;
    }
    Outlet
    {
        type            turbulentIntensityKineticEnergyInlet;
        intensity       0.05;
        value           uniform 0.46079;
    }
    Back
    {
        type            empty;
    }
    Front
    {
        type            empty;
    }
    Bottom
    {
        type            zeroGradient;
    }
    Top
    {
        type            zeroGradient;
    }
    e423_0 
    { 
        type kqRWallFunction; 
        value uniform 0.46079; 
    }
}


// ************************************************************************* //
