utils/scripts/estudioAutomatizacionPerfiles (Copy)/aleronTraseroV1/0.orig/nut
/*--------------------------------*- C++ -*----------------------------------*\
|       o        |                                                            |
|    o     o     |  HELYX (R) : Open-source CFD for Enterprise                |
|   o   O   o    |  Version : 4.4.1                                           |
|    o     o     |  ENGYS Ltd. <http://engys.com/>                            |
|       o        |                                                            |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      nut;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -1 0 0 0 0];


internalField   uniform 0.00371802;

boundaryField
{
    Inlet
    {
        type            calculated;
        value           uniform 0.00371802;
    }
    Outlet
    {
        type            calculated;
        value           uniform 0.00371802;
    }
    Back
    {
        type            empty;
    }
    Front
    {
        type            empty;
    }
    Bottom
    {
        type            slip;
        inputValue      uniform 0;
        value           uniform 0.00371802;
    }
    Top
    {
        type            slip;
        inputValue      uniform 0;
        value           uniform 0.00371802;
    }
    e423_0 
    { 
        type nutUTabulatedWallFunction; 
        value uniform 0.001;
    }
}


// ************************************************************************* //
