utils/scripts/estudioAutomatizacionPerfiles (Copy)/aleronTraseroV1/0.orig/omega
/*--------------------------------*- C++ -*----------------------------------*\
|       o        |                                                            |
|    o     o     |  HELYX (R) : Open-source CFD for Enterprise                |
|   o   O   o    |  Version : 4.4.1                                           |
|    o     o     |  ENGYS Ltd. <http://engys.com/>                            |
|       o        |                                                            |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      omega;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 -1 0 0 0 0];


internalField   uniform 29.5081;

boundaryField
{
    Inlet
    {
        type            turbulentMixingLengthFrequencyInlet;
        mixingLength    0.01;
        value           uniform 29.5081;
    }
    Outlet
    {
        type            turbulentMixingLengthFrequencyInlet;
        mixingLength    0.01;
        value           uniform 29.5081;
    }
    Back
    {
        type            empty;
    }
    Front
    {
        type            empty;
    }
    Bottom
    {
        type            zeroGradient;
    }
    Top
    {
        type            zeroGradient;
    }
    e423_0 
    { 
        type knopOmegaWallFunction;
        value uniform 29.5081; 
    }
}


// ************************************************************************* //
