utils/scripts/estudioAutomatizacionPerfiles (Copy)/aleronTraseroV1/0.orig/rho
/*--------------------------------*- C++ -*----------------------------------*\
|       o        |                                                            |
|    o     o     |  HELYX (R) : Open-source CFD for Enterprise                |
|   o   O   o    |  Version : 4.4.1                                           |
|    o     o     |  ENGYS Ltd. <http://engys.com/>                            |
|       o        |                                                            |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      rho;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -3 0 0 0 0 0];


internalField   uniform 1.225;

boundaryField
{
    Inlet
    {
        type            calculated;
        value           uniform 1.225;
    }
    Outlet
    {
        type            calculated;
        value           uniform 1.225;
    }
    Back
    {
        type            empty;
    }
    Front
    {
        type            empty;
    }
    Bottom
    {
        type            calculated;
        value           uniform 1.225;
    }
    Top
    {
        type            calculated;
        value           uniform 1.225;
    }
    e423_0
    {
        type            calculated;
        value           uniform 1.225;
    }
}


// ************************************************************************* //
