utils/scripts/estudioAutomatizacionPerfiles (Copy)/aleronTraseroV1/system/customNodeDict
/*--------------------------------*- C++ -*----------------------------------*\
|       o          |                                                          |
|    o     o       | HELYX(R): Open-source CFD for Enterprise                 |
|   o   O   o      | Version: v4.3.1                                          |
|    o     o       | Engys Ltd. http://www.engys.com                          |
|       o          |                                                          |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version 2.0;
    format ascii;
    class dictionary;
    location system;
    object customNodeDict;
}
    system
    {
        helyx_type directory;
    }
    constant
    {
        helyx_type directory;
    }
    0
    {
        helyx_type directory;
    }

