utils/scripts/estudioAutomatizacionPerfiles (Copy)/aleronTraseroV1/system/helyxHexMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
|       o          |                                                          |
|    o     o       | HELYX(R): Open-source CFD for Enterprise                 |
|   o   O   o      | Version: v4.3.1                                          |
|    o     o       | Engys Ltd. http://www.engys.com                          |
|       o          |                                                          |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version 2.0;
    format ascii;
    class dictionary;
    location system;
    object helyxHexMeshDict;
}
    castellatedMesh true;
    snap true;
    addLayers true;
    blockType block;
    blockData ( 0.01 0 );
    crackDetection false;
    crackTol 0.05;
    allowTopoChanges true;
    finalDecomposition ptscotch;
    meshMode quality;
    geometry
    {
        VR1.stl
        {
            type triSurfaceMesh;
            name VR1;
            appendRegionName false;
        }
        VR2.stl
        {
            type triSurfaceMesh;
            name VR2;
            appendRegionName false;
        }
        VR3.stl
        {
            type triSurfaceMesh;
            name VR3;
            appendRegionName false;
        }
        VR4.stl
        {
            type triSurfaceMesh;
            name VR4;
            appendRegionName false;
        }
        VR5.stl
        {
            type triSurfaceMesh;
            name VR5;
            appendRegionName false;
        }
        e423_0.stl
        {
            type triSurfaceMesh;
            name e423_0;
            appendRegionName false;
            transform
            {
                origin (0 0 0);      // Punto sobre el que gira (Borde de Ataque)
                rotation axisAngle;
                axis (0 1 0);        // Eje Y (perpendicular al plano 2D)
            angle 0;
            }
        }
    }
    castellatedMeshControls
    {
        features ( );
        refinementSurfaces
        {
            e423_0
            {
                level ( 7 7 );
            }
        }
        refinementRegions
        {
            VR1
            {
                mode inside;
                levels ( ( 100000.0 5 ) );
            }
            VR2
            {
                mode inside;
                levels ( ( 100000.0 4 ) );
            }
            VR3
            {
                mode inside;
                levels ( ( 100000.0 3 ) );
            }
            VR4
            {
                mode inside;
                levels ( ( 100000.0 2 ) );
            }
            VR5
            {
                mode inside;
                levels ( ( 100000.0 1 ) );
            }
            e423_0
            {
                mode distance;
                levels ( ( 0.1 7 ) );
            }
        }
        maxLocalCells 250000000;
        maxGlobalCells 1000000000;
        minRefinementCells 100;
        maxLoadUnbalance 0.1;
        nCellsBetweenLevels 2;
        resolveFeatureAngle -60.0;
        featureRefineAngle 20.0;
        refineSurfaceBoundary false;
        minBaffleAngle -60.0;
        allowFreeStandingZoneFaces false;
        balanceThenRefine true;
        nGapRefinements 0;
        minZoneRegionSize 1;
        additionalInsideCheck false;
        moveCentroidsTol -1.0;
        interfaceRefine true;
        splitCells false;
        wrapper
        {
            wrap false;
            volSources true;
            volDistance 1.0;
            meshInMM false;
            maxIter 200;
            writeFields false;
            invert false;
            sigma 3.0;
            cutoff 1000.0;
        }
        locationsInMesh ( ( ( 0 0.2 0.4 ) none ) );
        interZonesBaffle false;
        singleCellGapClosure false;
        filterFreeStandingHoles false;
        fullLeakChecks true;
        locationsOutsideMesh ( );
    }
    snapControls
    {
        featureEdges
        {
        }
        nOuterIter 1;
        nPreFeatureIter 0;
        nSolveIter 10;
        nFeatureIter 60;
        globalFeatureEdges true;
        globalRegionSnap false;
        nSmoothPatch 2;
        tolerance 4.0;
        nRelaxIter 5;
        zoneFeatureSnapping true;
        directFeatureSnapping true;
        geometryFeatureLines true;
        snapSurfBoundary true;
        collapseTol 0.25;
        enlargeStencil false;
        smoothSnappedSurface true;
        featureSnapChecks true;
        concaveTol 0.3;
        nSliverSmooths 10;
        mergeBoundaryFaces true;
        averageSurfaceNormal true;
        repatchOverlapping false;
        acuteReflexSnapAngle 25.0;
        minAcuteReflexSnapAngle 8.0;
    }
    addLayersControls
    {
        layers
        {
            Outlet
            {
                nSurfaceLayers 0;
                grownUp true;
            }
            Inlet
            {
                nSurfaceLayers 0;
                grownUp true;
            }
            Back
            {
                nSurfaceLayers 0;
                finalLayerThickness 0.4;
                expansionRatio 1.25;
                grownUp automatic;
            }
            Front
            {
                nSurfaceLayers 0;
                grownUp true;
            }
            Bottom
            {
                nSurfaceLayers 0;
                grownUp true;
            }
            Top
            {
                nSurfaceLayers 0;
                grownUp true;
            }
            e423_0
            {
                nSurfaceLayers 10;
                expansionRatio 1.25;
                maxLayerThickness 1.6;
                grownUp automatic;
            }
        }
        expansionRatio 1.25;
        finalLayerThickness 0.4;
        minThickness 0.2;
        featureAngleMerge 45;
        featureAngleTerminate 80.0;
        nRelaxIter 5;
        maxFaceThicknessRatio 2.0;
        maxThicknessToMedialRatio 0.3;
        minMedialAxisAngle 90;
        maxLayerIter 30;
        growConvexEdge true;
        growConcaveEdge true;
        growUpPatches true;
        rebalance false;
        layerRecovery 1;
        nSmoothThickness 10;
        nSmoothSurfaceNormals 6;
        nSmoothNormals 3;
        maxProjectionDistance 1.0E15;
        maxCellDistortion 50.0;
        medialRatioExp 1;
        growZoneLayers false;
        writeVTK true;
        fixedFCH false;
    }
    meshQualityControls
    {
        maxNonOrtho 70.0;
        maxBoundarySkewness 20;
        maxInternalSkewness 6;
        maxConcave 80.0;
        minFlatness 0.5;
        minVol 1.0E-16;
        minTetQuality -1.0E30;
        minArea 1.0E-13;
        minTwist 0.05;
        minDeterminant 1.0E-4;
        minFaceWeight 0.08;
        minVolRatio 0.02;
            angle 0;
        errorReduction 0.75;
        nSmoothScale 10;
        minVolCollapseRatio -1.0;
        faceFaceCells false;
        minSnapRelativeVolume -1;
        smoothAlignedEdges false;
        minSnapRelativeTetVolume -1;
        maxGaussGreenCentroid -1;
        nVolSmoothIter 8;
        maxCellAspectRatio -1.0;
        maxFaceCentreNonOrtho 180.0;
        minEdgeLength -1.0;
    }
    debug 0;
    mergeTolerance 1.0E-6;
    meshAlgorithm standard;
    outputProtected false;
    meshOptimization
    {
        type cfMeshOptimize;
        cfMeshOptimizeCoeffs
        {
            qualityThreshold 0.0;
            numLaplaceIterations 0;
            maxNumGlobalIterations 10;
            maxNumIterations 50;
            maxNumSurfaceIterations 2;
            relaxedCheck false;
            finalRelaxedCheck true;
            checkWarped false;
        }
    }
    cellRemoval
    {
        checks ( );
        patch oldInternalFaces;
        removeCells true;
        writeVTK true;
    }
   extrudeDict
  {
    extrude
    {
        // El tipo patchNormal asegura que la extrusión sea perpendicular al plano de simulación 
        type            patchNormal; 
        
        // Indica que se creará una malla nueva a partir del parche fuente 
        action          new;         
        
        // Parche desde donde se inicia la proyección (tu plano lateral) 
        sourcePatches   ( Front );   
        
        // Para simulaciones 2D puras, este valor DEBE ser 1 
        nLayers         1;           
        
        // Mantiene el tamaño de celda constante en la profundidad 
        expansionRatio  1;           
        
        // Nombre del parche que se creará en el lado opuesto 
        exposedPatchName Back;       

        // Espesor total de la celda 2D. 0.1 m es un valor estándar y estable.
        thickness       0.1;
    }
}
