utils/scripts/estudioAutomatizacionPerfiles (Copy)/aleronTraseroV1/system/helyxMapDict
/*--------------------------------*- C++ -*----------------------------------*\
|       o          |                                                          |
|    o     o       | HELYX(R): Open-source CFD for Enterprise                 |
|   o   O   o      | Version: v4.3.1                                          |
|    o     o       | Engys Ltd. http://www.engys.com                          |
|       o          |                                                          |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version 2.0;
    format ascii;
    class dictionary;
    location system;
    object helyxMapDict;
}
    sourceCase "";
    allRegions true;
    sourceTime latestTime;
    gridCells 1000000;

