utils/scripts/estudioAutomatizacionPerfiles (Copy)/aleronTraseroV1/system/projectDict
/*--------------------------------*- C++ -*----------------------------------*\
|       o          |                                                          |
|    o     o       | HELYX(R): Open-source CFD for Enterprise                 |
|   o   O   o      | Version: v4.3.1                                          |
|    o     o       | Engys Ltd. http://www.engys.com                          |
|       o          |                                                          |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version 2.0;
    format ascii;
    class dictionary;
    location system;
    object projectDict;
}
    baseDir "/home/introcfd/Desktop/aleronTraseroV1";
    parallel true;
    processors 4;
    T kelvin;
    solverName helyxSolve;
    topoSet
    {
        region ;
        actions ( );
    }
    report false;
    reportComparison false;
    reportComparisonPath "";
    reportComparisonOrientation portrait;

